cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
        <register>
          <name>CH3_CMD_REG2</name>
          <description>Channel 3 Third Line Channel Command</description>
          <addressOffset>0x308</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>

          <fields>
            <field>
              <name>BUFFER_SIZE</name>
              <description>Size (in Bytes) of Buffer to Transfer</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_CMD_REG3</name>
          <description>Channel 3 Fourth Line Channel Command</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CMD_SET_INT</name>
              <description>Active High Interrupt Enable once buffer has been transfered</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMD_LAST</name>
              <description>If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMD_NEXT_ADDR</name>
              <description>Address of next command if CMD_LAST is not set</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_STATIC_REG0</name>
          <description>Channel 3 Static Configuration Read</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80010000</resetValue>
          <resetMask>0x803f007f</resetMask>

          <fields>
            <field>
              <name>RD_BURST_MAX_SIZE</name>
              <description>Maximum number of bytes of an AHB read burst</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_TOKENS</name>
              <description>Number of AHB read commands to issue before channel is released</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_INCR</name>
              <description>If set the controller will increment the next burst address</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_STATIC_REG1</name>
          <description>Channel 3 Static Configuration Write</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80010000</resetValue>
          <resetMask>0x803f007f</resetMask>

          <fields>
            <field>
              <name>WR_BURST_MAX_SIZE</name>
              <description>Maximum number of bytes of an AHB write burst</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_TOKENS</name>
              <description>Number of AHB write commands to issue before channel is released</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_INCR</name>
              <description>If set the controller will increment the next burst address</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_STATIC_REG2</name>
          <description>Channel 3 Block Mode</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0x30010000</resetMask>

          <fields>
            <field>
              <name>JOINT</name>
              <description>If set channel will work in joint mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>END_SWAP</name>
              <description>Endianness Byte Swapping</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Swapping</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Swap bytes within 16 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Swap bytes within 32 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Swap bytes within 64 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_STATIC_REG4</name>
          <description>Channel 3 Static Configuration Peripheral</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x71f071f</resetMask>

          <fields>
            <field>
              <name>RD_PERIPH_NUM</name>
              <description>Number of peripheral to read from (0 if memory or no peripheral flow control)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_PERIPH_DELAY</name>
              <description>Number of cycles to wait for read request signal to update after issuing the read clear signal</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PERIPH_NUM</name>
              <description>Number of peripheral to write from (0 if memory or no peripheral flow control)</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PERIPH_DELAY</name>
              <description>Number of cycles to wait for write request signal to update after issuing the write clear signal</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_RESRICT_REG</name>
          <description>Channel 3 Restrictions Status Register</description>
          <addressOffset>0x32C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x11f</resetMask>

          <fields>
            <field>
              <name>RD_ALLOW_FULL_FIFO</name>
              <description>Read start address does not restrict burst size</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>WR_ALLOW_FULL_FIFO</name>
              <description>Write start address does not restrict burst size</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ALLOW_FULL_FIFO</name>
              <description>Burst sizes can equal data buffer size, otherwise max burst is half data buffer size</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ALLOW_FULL_BURST</name>
              <description>Maximum burst of 16 strobes can be used (joint mode only)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ALLOW_JOINT_BURST</name>
              <description>Joint bursts are currently active</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SIMPLE_MEM</name>
              <description>Configuration is aligned and peripherals are not used</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_FIFO_FULLNESS_REG</name>
          <description>Channel 3 FIFO Fullness Status Register</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff1fff</resetMask>

          <fields>
            <field>
              <name>RD_GAP</name>
              <description>Remaining space (in bytes) in FIFO for read data</description>
              <bitRange>[12:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>WR_FULLNESS</name>
              <description>Occupied space (in bytes) in FIFO by write data</description>
              <bitRange>[28:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_CH_ENABLE_REG</name>
          <description>Channel 3 Channel Enable Register</description>
          <addressOffset>0x340</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>CH3_CH_START_REG</name>
          <description>Channel 3 Channel Start Register</description>
          <addressOffset>0x344</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>CH3_CH_ACTIVE_REG</name>
          <description>Channel 3 Channel Active Status Register</description>
          <addressOffset>0x348</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>CH_RD_ACTIVE</name>
              <description>Set if channel is enabled and all read data has been received</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CH_WR_ACTIVE</name>
              <description>Set if channel is enabled and all write data has been transfered</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_COUNT_REG</name>
          <description>Channel 3 Buffer Counter Status Register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf0fff</resetMask>

          <fields>
            <field>
              <name>BUFF_COUNT</name>
              <description>Number of buffers transferred by channel since started</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>INT_COUNT</name>
              <description>Number of unserviced end interrupts</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_INT_RAWSTAT_REG</name>
          <description>Channel 3 Interrupt Raw Status (Write 1 to any field to issue interrupt)</description>
          <addressOffset>0x3A0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CH_END</name>
              <description>Indicates an unserviced channel end interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_SLVERR</name>
              <description>AHB read slave error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_SLVERR</name>
              <description>AHB write slave error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERFLOW</name>
              <description>FIFO has been overflown</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_UNDERFLOW</name>
              <description>FIFO has been underflown</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_RD</name>
              <description>Read timeout on AHB bus (timeout value fixed at 1024 cycles)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_WR</name>
              <description>Write timeout on AHB bus (timeout value fixed at 1024 cycles)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDT</name>
              <description>Channel active but did not start a burst for 2048 cycles</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_INT_CLEAR_REG</name>
          <description>Channel 3 Interrupt Clear (Write 1 to clear)</description>
          <addressOffset>0x3A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CH_END</name>
              <description>Clear channel end interrupt. Decrements INT_COUNT register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_SLVERR</name>
              <description>Clear AHB read slave error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_SLVERR</name>
              <description>Clear AHB write slave error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERFLOW</name>
              <description>Clears FIFO overflow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_UNDERFLOW</name>
              <description>Clears FIFO underflow</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_RD</name>
              <description>Clears Read Timeout</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_WR</name>
              <description>Clears Write Timeout</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDT</name>
              <description>Clears WDT</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_INT_ENABLE_REG</name>
          <description>Channel 3 Interrupt Enable</description>
          <addressOffset>0x3A8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CH_END</name>
              <description>Enables end of channel interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_SLVERR</name>
              <description>Enables AHB read slave error interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_SLVERR</name>
              <description>Enables AHB write slave error interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERFLOW</name>
              <description>Enables FIFO overflow interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_UNDERFLOW</name>
              <description>Enables FIFO underflow interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_RD</name>
              <description>Enables AHB Read timeout interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_WR</name>
              <description>Enables AHB Write timeout interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDT</name>
              <description>Enables WDT interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH3_INT_STATUS_REG</name>
          <description>Channel 3 Interrupt Status</description>
          <addressOffset>0x3AC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CH_END</name>
              <description>Indicates an unserviced channel end interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_SLVERR</name>
              <description>AHB read slave error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_SLVERR</name>
              <description>AHB write slave error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERFLOW</name>
              <description>FIFO has been overflown</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_UNDERFLOW</name>
              <description>FIFO has been underflown</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_RD</name>
              <description>Read timeout on AHB bus (timeout value fixed at 1024 cycles)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_WR</name>
              <description>Write timeout on AHB bus (timeout value fixed at 1024 cycles)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDT</name>
              <description>Channel active but did not start a burst for 2048 cycles</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_INT_STATUS</name>
          <description>Indicates which channels caused interrupt</description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>CHANNEL_0</name>
              <description>Indicates channel 0 caused interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CHANNEL_1</name>
              <description>Indicates channel 1 caused interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CHANNEL_2</name>
              <description>Indicates channel 2 caused interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CHANNEL_3</name>
              <description>Indicates channel 3 caused interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_JOINT_MODE</name>
          <description>If set, core works in joint mode</description>
          <addressOffset>0x830</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>CORE_PRIORITY</name>
          <description>Core Priority Channels</description>
          <addressOffset>0x838</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

