cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
          <fields>
            <field>
              <name>RD_PRIO_TOP_NUM</name>
              <description>Core Read Top Priority Channel Number</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_PRIO_TOP</name>
              <description>Core Read Top Priority Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_PRIO_HIGH_NUM</name>
              <description>Core Read High Priority Channel Number</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RD_PRIO_HIGH</name>
              <description>Core Read High Priority Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PRIO_TOP_NUM</name>
              <description>Core Write Top Priority Channel Number</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PRIO_TOP</name>
              <description>Core Write Top Priority Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PRIO_HIGH_NUM</name>
              <description>Core Write High Priority Channel Number</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WR_PRIO_HIGH</name>
              <description>Core Write High Priority Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_CLKDIV</name>
          <description>Ratio between main clock and core clock</description>
          <addressOffset>0x840</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xf</resetMask>
        </register>

        <register>
          <name>CORE_CH_START</name>
          <description>Channel Start</description>
          <addressOffset>0x848</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>CH_0</name>
              <description>Starts Channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>CH_1</name>
              <description>Starts Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>CH_2</name>
              <description>Starts Channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>CH_3</name>
              <description>Starts Channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PERIPH_RX_CTRL</name>
          <description>Direct control of peripheral RX request</description>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfffffffe</resetMask>

          <fields>
            <field>
              <name>RX_REQ</name>
              <description>Allows direct control of the peripheral RX request bus</description>
              <bitRange>[31:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PERIPH_TX_CTRL</name>
          <description>Direct control of peripheral TX request</description>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfffffffe</resetMask>

          <fields>
            <field>
              <name>TX_REQ</name>
              <description>Allows direct control of the peripheral TX request bus</description>
              <bitRange>[31:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_IDLE</name>
          <description>Indicates all channels have stopped and transactions have completed</description>
          <addressOffset>0x8D0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>USER_DEF_STATUS</name>
          <description>User Defined Configurations</description>
          <addressOffset>0x8E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80000001</resetValue>
          <resetMask>0x800007ef</resetMask>

          <fields>
            <field>
              <name>INT_NUM</name>
              <description>Number of bits in interrupt bus</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>DUAL_CORE</name>
              <description>If set the design has two cores</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>IC</name>
              <description>If set an AHB matrix is used</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>IC_DUAL_PORT</name>
              <description>If set AHB matrix has two output ports</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CLKGATE</name>
              <description>If set design contains functional clock gates</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PORT0_MUX</name>
              <description>If set AHB port 0 is using an AHB mux</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PORT1_MUX</name>
              <description>If set AHB port 1 is using an AHB mux</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PROJ</name>
              <description>User Defined Project</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_DEF_STATUS0</name>
          <description>User Defined Core Configurations 0</description>
          <addressOffset>0x8F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xA601151</resetValue>
          <resetMask>0x1f7fffff</resetMask>

          <fields>
            <field>
              <name>CH_NUM</name>
              <description>Number of channels (reads 1, should read 4)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FIFO_SIZE</name>
              <description>Log2 of FIFO size per channel</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>WCMD_DEPTH</name>
              <description>Log2 of maximum number of pending write commands</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RCMD_DEPTH</name>
              <description>Log2 of maximum number of pending read commands</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ADDR_BITS</name>
              <description>Number of bits in address buses</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>AHB_BUS_32</name>
              <description>If set AHB bus is 32 bit otherwise 64 bit</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BUFF_BITS</name>
              <description>Number of bits in BUFFER_SIZE</description>
              <bitRange>[28:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CORE_DEF_STATUS1</name>
          <description>User Defined Core Configurations 1</description>
          <addressOffset>0x8F4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xF87</resetValue>
          <resetMask>0x1fff</resetMask>

          <fields>
            <field>
              <name>WDT</name>
              <description>Set if core has watchdog timer</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>AHB_TIMEOUT</name>
              <description>Set if core supports timeouts on AHB read and write buses</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TOKENS</name>
              <description>Set if core has tokens support</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PRIO</name>
              <description>Set if core has priority modes support</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>OUTS</name>
              <description>Set if core supports outstanding mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>WAIT</name>
              <description>Set if core supports scheduled channels</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK</name>
              <description>Set if core supports block transfer</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JOINT</name>
              <description>Set if core supports joint mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>INDEPENDENT</name>
              <description>Set if core supports independent mode</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PERIPH</name>
              <description>Set if core supports peripherals</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>LISTS</name>
              <description>Set if core supports command lists</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>END</name>
              <description>Set if core supports endianness swapping</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CLKDIV</name>
              <description>Set if core supports clock division ratios</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
