cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="UART0"> <!-- Family =  UART :: Name = UART1 -->
      <name>UART1</name>
      <baseAddress>0x40005000</baseAddress>
    </peripheral>

    <peripheral> <!-- Family = SPI :: Name = SPI0 -->
      <name>SPI0</name>
      <version>1.0.0</version>
      <description>SPI Master/Slave Controller</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40006000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>TRANSMIT_DATA</name>
          <description>Writes one byte to SPI Transmit Data FIFO. </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>TX_BYTE</name>
              <description>Writes data in transmit FIFO. </description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_DATA</name>
          <description>Read one byte from SPI Receive Data FIFO. </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>RX_BYTE</name>
              <description>Oldest data in receive FIFO. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TRANSMIT_STATUS</name>
          <description>Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL</name>
              <description>Active High indication when Tx FIFO can still accepts at least one more character.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>TX FIFO Full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>TX FIFO not Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least quarter empty. Reset when more. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least half empty. Reset when more. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least three quarters empty. Reset when more. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY</name>
              <description>Active High indication when Tx FIFO is Empty and has no more character to transmit </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_STATUS</name>
          <description>Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. </description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY</name>
              <description>Active High indication when data is available in Rx FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL</name>
              <description>Active High indication when FIFO is at least quarter full. Reset when less. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL</name>
              <description>Active High indication when FIFO is at least half full. Reset when less. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL</name>
              <description>Active High indication when FIFO is at least three quarters full. Reset when less. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FAULT</name>
              <description>Active High indication when two masters attempt to access the SPI bus at the same time. The SPI interface will put itself in slave mode in this case. This bit is reset when the status register is read.  </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FIFO_OVERRUN</name>
              <description>Active High indication when character is received but FIFO is full. Reset by reading  the status register. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CLOCK_SOURCE_SELECT</name>
          <description>Clock Source Select</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>CLOCK</name>
              <description>Clock Used to Generate Divided Clock</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26 MHz Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13 MHz Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5 MHz Clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25 MHz Clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_CLK_DIVIDER</name>
          <description>Register sets the divide ratio used to generate the sck clock from the module's input clock. </description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>SPI_DIVIDE_RATIO</name>
              <description>Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_MODULE_ENABLE</name>
          <description>SPI Enable</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables SPI operation</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_MASTER_MODE</name>
          <description>SPI Master/Slave Mode. When clear, SPI is in Slave Mode. </description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>MASTER_ENABLE</name>
              <description>Active High SPI Master Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SPI Slave</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SPI Master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_FAULT_ENABLE</name>
          <description>SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.  </description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>FAULT_ENABLE</name>
              <description>Active High SPI Fault Detect Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Faults ignored on SPI bus</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Faults detected on SPI bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_CONFIGURATION</name>
          <description>SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed. </description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xE0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>SCK_POLARITY</name>
              <description>Selects the level of sck in Idle State</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SCK is Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SCK is High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SCK_PHASE</name>
              <description>Selects clock edge used for data sampling and launching</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bits are sampled on the first edge and the following bit is output on the next edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bits are output on the first edge and are sampled on the following edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LSB_FIRST_ENABLE</name>
              <description>Selects LSB bits to be transmitted first</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data transmitted MSB first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data transmitted LSB first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>BIDIRECTIONAL_ENABLE</name>
              <description>Enable Bidirectional mode of operation</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SPI is unidirectional, Tx and Rx each has dedicated one port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SPI is bidirectional, Tx and Rx share one input/output port (MOSI if Master, MISO if Slave)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>OUTPUT_ENABLE</name>
              <description>Active High Output Enable when in Bidirectional Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>MISO is an input if in Slave mode. MOSI is an input if in Master mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MISO is an output if in Slave mode. MOSI is an output if in Master mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SSN_SHIFT_ENABLE</name>
              <description>Active High Shift Enable when SSN signal is asserted</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Shift counter is enabled only when ssn is asserted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Shift counter is always enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SSN_SYNC_ENABLE</name>
              <description>Active High SSN Signal Synchronisation Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SSN internal synchronisation is bypassed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SSN is internally synchronised before being used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RX_DONE_SYNC_ENABLE</name>
              <description>Active High rx_done Signal Synchronisation Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>rx_done internal synchronisation is bypassed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>rx_done is internally synchronised before being used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SPI_BUS_STATUS</name>
          <description>Status of SPI bus. </description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>SPI_ACTIVE</name>
              <description>Active High indicatation that the SPI Module is active. While set, SPI configuration should not be modified. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the tx_status register. </description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL_MASK</name>
              <description>Active High Enable of tx_fifo_not_full interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p25_empty interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p5_empty interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p75_empty interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_empty interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the rx_status register. </description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY_MASK</name>
              <description>Active High Enable of rx_fifo_not_empty interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p25_full interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p5_full interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p75_full interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FAULT_DETECT_MASK</name>
              <description>Active High Enable of fault detection interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERRUN_MASK</name>
              <description>Active High Enable of FIFO overrun interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
