cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="WDT0"> <!-- Family =  WDT :: Name = WDT1 -->
      <name>WDT1</name>
      <baseAddress>0x40009000</baseAddress>
    </peripheral>

    <peripheral> <!-- Family = EFUSE_MISC_REGS :: Name = EFUSE_MISC_REGS0 -->
      <name>EFUSE_MISC_REGS0</name>
      <version>1.0.0</version>
      <description>EFUSE Misc Registers</description>
      <groupName>EFUSE_MISC_REGS</groupName>
      <baseAddress>0x4000a000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>EFUSE_GLOBAL_RESET</name>
          <description>All individual software controllable resets. 0: Reset the selected function. 1: Normal operation. </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0x7f</resetMask>

          <fields>
            <field>
              <name>GLOBAL_RSTN</name>
              <description>Global Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_1_RSTN</name>
              <description>EFUSE 1 Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_2_RSTN</name>
              <description>EFUSE 2 Reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_3_RSTN</name>
              <description>EFUSE 3 Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_4_RSTN</name>
              <description>EFUSE 4 Reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_5_RSTN</name>
              <description>EFUSE 5 Reset</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_6_RSTN</name>
              <description>EFUSE 6 Reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_1_CONTROL</name>
          <description>EFUSE 1 Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_2_CONTROL</name>
          <description>EFUSE 2 Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_3_CONTROL</name>
          <description>EFUSE 3 Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_4_CONTROL</name>
          <description>EFUSE 4 Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_5_CONTROL</name>
          <description>EFUSE 5 Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_6_CONTROL</name>
          <description>EFUSE 6 Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC</resetValue>
          <resetMask>0x87ffffff</resetMask>

          <fields>
            <field>
              <name>FORCE_LOAD</name>
              <description>Efuse Control Force Load</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_PROGRAM</name>
              <description>When set to 1 will start programming EFUSE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_READ_COUNT</name>
              <description>First Read Count</description>
              <bitRange>[10:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIRST_PROG_COUNT</name>
              <description>First Program Count</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PROG_CLK_H_COUNT</name>
              <description>First Clock High Count</description>
              <bitRange>[23:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEBUG_BUS_SEL</name>
              <description>EFUSE Debug Bus Selection</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LOAD_DONE</name>
              <description>Efuse Load Done Indication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_1_PROG_0</name>
          <description>EFUSE_1_0 Program Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_PROG_1</name>
          <description>EFUSE_1_1 Program Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_PROG_2</name>
          <description>EFUSE_1_2 Program Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_PROG_3</name>
          <description>EFUSE_1_3 Program Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_STATUS_0</name>
          <description>EFUSE_1_0 Status</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_STATUS_1</name>
          <description>EFUSE_1_1 Status</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_STATUS_2</name>
          <description>EFUSE_1_2 Status</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_1_STATUS_3</name>
          <description>EFUSE_1_3 Status</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_PROG_0</name>
          <description>EFUSE_2_0 Program Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_PROG_1</name>
          <description>EFUSE_2_1 Program Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_PROG_2</name>
          <description>EFUSE_2_2 Program Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_PROG_3</name>
          <description>EFUSE_2_3 Program Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_STATUS_0</name>
          <description>EFUSE_2_0 Status</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_STATUS_1</name>
          <description>EFUSE_2_1 Status</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_STATUS_2</name>
          <description>EFUSE_2_2 Status</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_2_STATUS_3</name>
          <description>EFUSE_2_3 Status</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_PROG_0</name>
          <description>EFUSE_3_0 Program Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_PROG_1</name>
          <description>EFUSE_3_1 Program Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_PROG_2</name>
          <description>EFUSE_3_2 Program Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_PROG_3</name>
          <description>EFUSE_3_3 Program Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_STATUS_0</name>
          <description>EFUSE_3_0 Status</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_STATUS_1</name>
          <description>EFUSE_3_1 Status</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_STATUS_2</name>
          <description>EFUSE_3_2 Status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_3_STATUS_3</name>
          <description>EFUSE_3_3 Status</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_PROG_0</name>
          <description>EFUSE_4_0 Program Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_PROG_1</name>
          <description>EFUSE_4_1 Program Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_PROG_2</name>
          <description>EFUSE_4_2 Program Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

