cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
        <register>
          <name>EFUSE_4_PROG_3</name>
          <description>EFUSE_4_3 Program Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_STATUS_0</name>
          <description>EFUSE_4_0 Status</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_STATUS_1</name>
          <description>EFUSE_4_1 Status</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_STATUS_2</name>
          <description>EFUSE_4_2 Status</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_4_STATUS_3</name>
          <description>EFUSE_4_3 Status</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_PROG_0</name>
          <description>EFUSE_4_0 Program Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_PROG_1</name>
          <description>EFUSE_5_1 Program Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_PROG_2</name>
          <description>EFUSE_5_2 Program Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_PROG_3</name>
          <description>EFUSE_5_3 Program Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_STATUS_0</name>
          <description>EFUSE_5_0 Status</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_STATUS_1</name>
          <description>EFUSE_5_1 Status</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_STATUS_2</name>
          <description>EFUSE_5_2 Status</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_5_STATUS_3</name>
          <description>EFUSE_5_3 Status</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_PROG_0</name>
          <description>EFUSE_6_0 Program Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_PROG_1</name>
          <description>EFUSE_6_1 Program Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_PROG_2</name>
          <description>EFUSE_6_2 Program Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_PROG_3</name>
          <description>EFUSE_6_3 Program Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_STATUS_0</name>
          <description>EFUSE_6_0 Status</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_STATUS_1</name>
          <description>EFUSE_6_1 Status</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_STATUS_2</name>
          <description>EFUSE_6_2 Status</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_6_STATUS_3</name>
          <description>EFUSE_6_3 Status</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>EFUSE_MISC_CTRL</name>
          <description>EFUSE 6 Control Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>OUT_OF_RESET</name>
              <description>Read back the status of the eFuse out of reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
