cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>AES_AHB_CLK_EN</name>
              <description>AES AHB Clock Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_1_0_MEM_CLK_EN</name>
              <description>IDRAM1_0 Memory Clock Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_1_1_MEM_CLK_EN</name>
              <description>IDRAM1_1 Memory Clock Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_1_2_MEM_CLK_EN</name>
              <description>IDRAM1_2 Memory Clock Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_2_0_MEM_CLK_EN</name>
              <description>IDRAM2_0 Memory Clock Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_2_1_MEM_CLK_EN</name>
              <description>IDRAM2_1 Memory Clock Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BTMCU_CONTROL</name>
          <description>Miscellaneous BLE control</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>

          <fields>
            <field>
              <name>RXTX_SEQ_CLK_EN</name>
              <description>BLE RXTX Sequencer Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AHB_CLK_EN</name>
              <description>BLE HAB Clock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PERIPH_REGS_CLK_EN</name>
              <description>BLE Periph Regs Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_CONTROL</name>
          <description>Miscellaneous LPMCU control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x303100</resetValue>
          <resetMask>0xfff9333f</resetMask>

          <fields>
            <field>
              <name>LPMCU_CLK_SEL</name>
              <description>LPMCU Clock Frequency Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>USE_BT26M_CLK</name>
              <description>Use XO as ARM clock (must also set use_arm_lp_clk)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_ARM_LP_CLK</name>
              <description>Use either LP 2MHz clock or XO as ARM clock</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DUALTIMER_CLK_SEL</name>
              <description>DUALTIMER0 Clock Frequency Select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>BYPASS_WIC</name>
              <description>Bypass Wakeup Interrupt Controller</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_XO_FOR_LP_CAL_CLK</name>
              <description>Use the XO for Low Power Clock Calibration</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPIFLASH_CLKSEL</name>
              <description>SPI_FLASH0 Clock Frequency Select</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>3.25MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>6.5MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>13MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>26MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SPIFLASH_DIV_CLK_SEL</name>
              <description>Use Generated Divided Clock for SPI_FLASH0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_1_MEM_IQ_BYP_EN</name>
              <description>Mux Control to select between FECE and standard IDRAM memory. Default to IDRAM ARM Memory</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPI_FLASH_CLOCK_DIV_VALUE</name>
              <description>Integer divider value. 26mhz clock will be divided by this register value </description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INVERT_UART_IF_CLK</name>
              <description>Inverts UART0 interface clock  </description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INVERT_UART_1_IF_CLK</name>
              <description>Inverts UART1 interface clock  </description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_MBIST</name>
          <description>MBIST designation</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>MBIST_MODE</name>
              <description>Puts the chip in MBIST mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BLE_CTRL</name>
          <description>BLE Control</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>BLE_WAKEUP_REQ</name>
              <description>BLE Wakeup Request (to BLE Sleep Timer)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_WAKEUP_REQ_CORE</name>
              <description>BLE Wakeup Request (to BLE Core)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MBIST_CONTROL</name>
          <description>MBIST Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>MBIST_STATUS</name>
          <description>MBIST Status Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>MBIST_BUS</name>
              <description>Observation of MBIST results</description>
              <bitRange>[20:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>MBIST_BLOCK_SEL</name>
              <description>Observation of block field of MBIST control</description>
              <bitRange>[25:21]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>MBIST_WRAPPER_SEL</name>
              <description>Observation of wrapper field of MBIST control</description>
              <bitRange>[30:26]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>MBIST_MODE</name>
              <description>Observation of mbist_mode signal</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MBIST_SRAM_ALG_SEL</name>
          <description>Enables MBIST algorithms</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4F</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>MARCH2_ENABLE</name>
              <description>Enables the march2 algorithm</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UNIQUE_ENABLE</name>
              <description>Enables the unique address algorithm</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CHECKERBOARD_ENABLE</name>
              <description>Enables the checkerboard algorithm</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DIAGONAL_ENABLE</name>
              <description>Enables the diagonal algorithm</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ADDRDEC0_ENABLE</name>
              <description>Enables the address decoder bg0 algorithm</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ADDRDEC1_ENABLE</name>
              <description>Enables the address decoder bg1 algorithm</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COLMARCH1_ENABLE</name>
              <description>Enables the col_march1 algorithm</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FILLWITH0_ENABLE</name>
              <description>Enables the fillwith0 algorithm</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_READ_ZEROS_ENABLE</name>
              <description>Enables the ret read zeros algorithm</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_WRITE_ZEROS_ENABLE</name>
              <description>Enables the ret write zeros algorithm</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_READ_ONES_ENABLE</name>
              <description>Enables the ret read ones algorithm</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_WRITE_ONES_ENABLE</name>
              <description>Enables the ret write ones algorithm</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_READ_CB_ENABLE</name>
              <description>Enables the ret read checkerboard algorithm</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_WRITE_CB_ENABLE</name>
              <description>Enables the ret write checkerboard algorithm</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_READ_INVCB_ENABLE</name>
              <description>Enables the ret read inv checkerboard algorithm</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RET_WRITE_INVCB_ENABLE</name>
              <description>Enables the ret write inv checkerboard algorithm</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MBIST_BG</name>
          <description>MBIST Background for MARCH2 algorithm (bits 31:0)</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TEST_BUS_CONTROL</name>
          <description>Controls all of the test bus functionality</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>TEST_ENABLE_ARM</name>
              <description>Selects periph test bus</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>WP3_MISR_DATAOUT</name>
          <description>ROM MBIST Signature</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>INVERT_OUTPUT_CTRL</name>
          <description>Invert Output Control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf9ffffff</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_0</name>
              <description>Invert the output for lp_gpio_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_1</name>
              <description>Invert the output for lp_gpio_1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_2</name>
              <description>Invert the output for lp_gpio_2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_3</name>
              <description>Invert the output for lp_gpio_3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_4</name>
              <description>Invert the output for lp_gpio_4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_5</name>
              <description>Invert the output for lp_gpio_5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_6</name>
              <description>Invert the output for lp_gpio_6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_7</name>
              <description>Invert the output for lp_gpio_7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_8</name>
              <description>Invert the output for lp_gpio_8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_9</name>
              <description>Invert the output for lp_gpio_9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_10</name>
              <description>Invert the output for lp_gpio_10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_11</name>
              <description>Invert the output for lp_gpio_11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_12</name>
              <description>Invert the output for lp_gpio_12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_13</name>
              <description>Invert the output for lp_gpio_13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_14</name>
              <description>Invert the output for lp_gpio_14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_15</name>
              <description>Invert the output for lp_gpio_15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_16</name>
              <description>Invert the output for lp_gpio_16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_17</name>
              <description>Invert the output for lp_gpio_17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_18</name>
              <description>Invert the output for lp_gpio_18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_19</name>
              <description>Invert the output for lp_gpio_19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_20</name>
              <description>Invert the output for lp_gpio_20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_21</name>
              <description>Invert the output for lp_gpio_21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_22</name>
              <description>Invert the output for lp_gpio_22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_23</name>
              <description>Invert the output for lp_gpio_23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_0</name>
              <description>Invert the output for lp_sip_0</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_1</name>
              <description>Invert the output for lp_sip_1</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

