cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>LP_SIP_2</name>
              <description>Invert the output for lp_sip_2</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_3</name>
              <description>Invert the output for lp_sip_3</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_4</name>
              <description>Invert the output for lp_sip_4</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PINMUX_SEL_0</name>
          <description>Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x22</resetValue>
          <resetMask>0x77777777</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_0_SEL</name>
              <description>Pinmux select for LP_GPIO_0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_CLK</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_0</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_1_SEL</name>
              <description>Pinmux select for LP_GPIO_1</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_IO</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_1</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_2_SEL</name>
              <description>Pinmux select for LP_GPIO_2</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SCK</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SCK</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_2</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_3_SEL</name>
              <description>Pinmux select for LP_GPIO_3</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_MOSI</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MOSI</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_TXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_3</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_4_SEL</name>
              <description>Pinmux select for LP_GPIO_4</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SSN</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SSN</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_4</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_5_SEL</name>
              <description>Pinmux select for LP_GPIO_5</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_MISO</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MISO</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_5</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_6_SEL</name>
              <description>Pinmux select for LP_GPIO_6</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SCK</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_6</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_7_SEL</name>
              <description>Pinmux select for LP_GPIO_7</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MOSI</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_TXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_7</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PINMUX_SEL_1</name>
          <description>Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0x77777777</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_8_SEL</name>
              <description>Pinmux select for LP_GPIO_8</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SSN</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_8</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_9_SEL</name>
              <description>Pinmux select for LP_GPIO_9</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MISO</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_9</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_10_SEL</name>
              <description>Pinmux select for LP_GPIO_10</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SCK</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_10</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_11_SEL</name>
              <description>Pinmux select for LP_GPIO_11</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MOSI</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_TXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_11</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_12_SEL</name>
              <description>Pinmux select for LP_GPIO_12</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SSN</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_12</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_13_SEL</name>
              <description>Pinmux select for LP_GPIO_13</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MISO</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_13</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_14_SEL</name>
              <description>Pinmux select for LP_GPIO_14</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_14</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

