cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>LP_GPIO_20</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_21</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_22</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_23</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PINMUX_SEL_3</name>
          <description>Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x77777</resetMask>

          <fields>
            <field>
              <name>LP_SIP_0_SEL</name>
              <description>Pinmux select for LP_SIP_0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_FLASH0_SCK</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_SIP_1_SEL</name>
              <description>Pinmux select for LP_SIP_1</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_FLASH0_TXD</name>
                  <description>MUX function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_SIP_2_SEL</name>
              <description>Pinmux select for LP_SIP_2</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_SIP_3_SEL</name>
              <description>Pinmux select for LP_SIP_3</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_SIP_4_SEL</name>
              <description>Pinmux select for LP_SIP_4</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_FLASH0_WP</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ISHAPE_PAD_3</name>
          <description>Controls the ISHAPE pad value for LPMCU SIP Pads</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555</resetValue>
          <resetMask>0x77777</resetMask>

          <fields>
            <field>
              <name>LP_SIP_0</name>
              <description>Controls ISHAPE value LP_SIP_0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_1</name>
              <description>Controls ISHAPE value LP_SIP_1</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_2</name>
              <description>Controls ISHAPE value LP_SIP_2</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_3</name>
              <description>Controls ISHAPE value LP_SIP_3</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_4</name>
              <description>Controls ISHAPE value LP_SIP_4</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PINMUX_SEL_4</name>
          <description>Pinmux select for LP_GPIO_24</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_24_SEL</name>
              <description>Pinmux select for LP_GPIO_24</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_CONTROL_2</name>
          <description>Misc control for the LPMCU</description>
          <addressOffset>0x90</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>SPI_FLASH_CLOCK_FRAC_VALUE</name>
              <description>SPI_FLASH0 Fractional Divider Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SPIFLASH_VDDIO_CTRL</name>
          <description>Control for VDDIO of SPI FLASH</description>
          <addressOffset>0xA0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables power for the stacked (internal) SPI FLASH</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SPIFLASH_BYPASS</name>
          <description>SPI FLASH Bypass</description>
          <addressOffset>0xA4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables Bypass of SPI Flash Controller</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>IRQ_MUX_IO_SEL_0</name>
          <description>Arm Cortex IRQ Mux Selection (Refer to Interrupts Spreadsheet)</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f1f1f</resetMask>

          <fields>
            <field>
              <name>MUX_0</name>
              <description>IRQ_0 Source Selection</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>UART0 RX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MUX_1</name>
              <description>IRQ_1 Source Selection</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>UART0 TX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

