cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>EFUSE_OUT_OF_RESET</name>
              <description>Read the efuse_out_of_reset signal from the efuse wrapper</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MSEMI_MEM_CTRL</name>
          <description>Control the rwm, rm and wm on the Mobile Semi Memories</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7777777</resetMask>

          <fields>
            <field>
              <name>PD2A_MEM_RWM_EN</name>
              <description>RWM control for pd2a memory</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2A_MEM_WM_EN</name>
              <description>WM control for pd2a memory</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2A_MEM_RM_EN</name>
              <description>RM control for pd2a memory</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2B_MEM_RWM_EN</name>
              <description>RWM control for pd2b memory</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2B_MEM_WM_EN</name>
              <description>WM control for pd2b memory</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2B_MEM_RM_EN</name>
              <description>RM control for pd2b memory</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3A_MEM_RWM_EN</name>
              <description>RWM control for pd3a memory</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3A_MEM_WM_EN</name>
              <description>WM control for pd3a memory</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3A_MEM_RM_EN</name>
              <description>RM control for pd3a memory</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3B_MEM_RWM_EN</name>
              <description>RWM control for pd3b memory</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3B_MEM_WM_EN</name>
              <description>WM control for pd3b memory</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3B_MEM_RM_EN</name>
              <description>RM control for pd3b memory</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3C_MEM_RWM_EN</name>
              <description>RWM control for pd3c memory</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3C_MEM_WM_EN</name>
              <description>WM control for pd3c memory</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3C_MEM_RM_EN</name>
              <description>RM control for pd3c memory</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD5_MEM_RWM_EN</name>
              <description>RWM control for pd5 memory</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD5_MEM_WM_EN</name>
              <description>WM control for pd5 memory</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD5_MEM_RM_EN</name>
              <description>RM control for pd5 memory</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD8_MEM_RWM_EN</name>
              <description>RWM control for pd8 memory</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD8_MEM_WM_EN</name>
              <description>WM control for pd8 memory</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD8_MEM_RM_EN</name>
              <description>RM control for pd8 memory</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>EFUSE_1_STATUS_3</name>
          <description>EFUSE_1_3 Status</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>LPMCU_FORCE_CONTROL</name>
          <description>Miscellaneous Force control values for LPMCU</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF7F</resetValue>
          <resetMask>0x1fff</resetMask>

          <fields>
            <field>
              <name>SCLK_EN</name>
              <description>Enable Force Control of SCLK</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SCLK_VAL</name>
              <description>Enable Force Control of SCLK Value</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DCLK_EN</name>
              <description>Enable Force Control of DCLK</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DCLK_VAL</name>
              <description>Enable Force Control of DCLK Value</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PCLKG_EN</name>
              <description>Enable Force Control of PCLKG</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PCLKG_VAL</name>
              <description>Enable Force Control of PCLKG Value</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WICENREQ_EN</name>
              <description>Enable Force Control of WIC Enable Request to use WIC during Sleep Conditions</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WICENREQ_VAL</name>
              <description>Enable Force Control of WIC Enable Value</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>GPIO_GCLK_EN</name>
              <description>Enable Force Control of GPIO Modules Clk (override clock gating and enable)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COUNTER_PGCLK_EN</name>
              <description>Enable Force Control of Counter Modules Clk (override clock gating and enable)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DUALTIMER_PGCLK_EN</name>
              <description>Enable Force Control of DualTimer Modules PGClk (override clock gating and enable)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WICENACK_EN</name>
              <description>Enable Force Control of WIC ACK to use WIC during Sleep Conditions - Requires Handshake from WIC when its ok to sleep</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WICENACK_VAL</name>
              <description>Enable Force Control of WIC Enable Value - Requires Handshake from WIC when its ok to sleep</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ARM_IRQ_STATUS_0</name>
          <description>ARM Cortex M0 IRQ Status</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ARM_IRQ_STATUS_1</name>
          <description>ARM Cortex M0 IRQ Status</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>BLE_DEEP_SLEEP_ENABLES</name>
          <description>BLE Deep Sleep Enables</description>
          <addressOffset>0x240</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>FW_TIMER_CORR_EN</name>
              <description>Enables FW Timer Correction Operation</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>HW_TIMER_CORR_EN</name>
              <description>Enables HW Timer Correction Operation</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DEEP_SLEEP_HW_TIMER_CORR</name>
          <description>Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF424000</resetValue>
          <resetMask>0x3ffff3ff</resetMask>

          <fields>
            <field>
              <name>WAIT</name>
              <description>Wait time in us after wakeup before correction begins</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RTC_TOSC</name>
              <description>Period of RTC clock in us [7.11]</description>
              <bitRange>[29:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>REMAP_IDRAM1_BASE_ADDR</name>
          <description>ARM Cortex M0 idram 1 remap base addr</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>REMAP_IDRAM1_END_ADDR</name>
          <description>ARM Cortex M0 idram 1 remap end addr</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFF</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>REMAP_IDRAM2_BASE_ADDR</name>
          <description>ARM Cortex M0 idram 2 remap base addr</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>REMAP_IDRAM2_END_ADDR</name>
          <description>ARM Cortex M0 idram 2 remap end addr</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FFF</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>REMAP_BOOT_BASE_ADDR</name>
          <description>ARM Cortex M0 bootrom remap base addr</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>REMAP_BOOT_END_ADDR</name>
          <description>ARM Cortex M0 bootrom remap end addr</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1001FFFF</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>QUAD_DEC_IRQS</name>
          <description>Reflects the IRQ status of the Quad Decoders</description>
          <addressOffset>0x280</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>

          <fields>
            <field>
              <name>QUAD_DEC_1_IRQ</name>
              <description>QUAD_DEC0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>QUAD_DEC_2_IRQ</name>
              <description>QUAD_DEC1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>QUAD_DEC_3_IRQ</name>
              <description>QUAD_DEC2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_1_STATUS</name>
          <description>Current status of Quad Decoder 1</description>
          <addressOffset>0x284</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>COUNT</name>
              <description>Current count of QUAD_DEC0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_2_STATUS</name>
          <description>Current status of Quad Decoder 2</description>
          <addressOffset>0x288</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>COUNT</name>
              <description>Current count of QUAD_DEC1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_3_STATUS</name>
          <description>Current status of Quad Decoder 3</description>
          <addressOffset>0x28C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>COUNT</name>
              <description>Current count of QUAD_DEC2</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_1_THRESHOLD</name>
          <description>Thresholds for Quad Decoder 1</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF00</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>UPPER</name>
              <description>Upper Threshold of counter for QUAD_DEC0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LOWER</name>
              <description>Lower Threshold of counter for QUAD_DEC0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_1_CTRL</name>
          <description>Control for Quad Decoder 1</description>
          <addressOffset>0x294</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Quad Decoder</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLR_IRQ</name>
              <description>Clear IRQ From Quad Decoder</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>Quad Decoder Source Clock Frequency Select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_2_THRESHOLD</name>
          <description>Thresholds for Quad Decoder 2</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF00</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>UPPER</name>
              <description>Upper Threshold of counter for QUAD_DEC1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LOWER</name>
              <description>Lower Threshold of counter for QUAD_DEC1</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_2_CTRL</name>
          <description>Control for Quad Decoder 2</description>
          <addressOffset>0x2A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Quad Decoder</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLR_IRQ</name>
              <description>Clear IRQ From Quad Decoder</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>Quad Decoder Source Clock Frequency Select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>QUAD_DEC_3_THRESHOLD</name>
          <description>Thresholds for Quad Decoder 3</description>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF00</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>UPPER</name>
              <description>Upper Threshold of counter for QUAD_DEC2</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LOWER</name>
              <description>Lower Threshold of counter for QUAD_DEC2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

