cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = LP_CLK_CAL_REGS :: Name = LP_CLK_CAL_REGS0 -->
      <name>LP_CLK_CAL_REGS0</name>
      <version>1.0.0</version>
      <description>Low Power Clock Calibration Registers</description>
      <groupName>LP_CLK_CAL_REGS</groupName>
      <baseAddress>0x4000c000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CONFIG_REG</name>
          <description>Configuration of the calibration clocks and the enable of calibration</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0cf</resetMask>

          <fields>
            <field>
              <name>NUMBER_CALIB_CLKS</name>
              <description>Multiplier value for the number of calibration clocks (1 shifted left by _value_)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1 clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2 clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>4 clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>8 clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>16 clocks</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>32 clocks</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>64 clocks</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>128 clocks</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>256 clocks</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>512 clocks</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1024 clocks</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>2048 clocks</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>4096 clocks</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>8192 clocks</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>16384 clocks</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>32768 clocks</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>START_RTC_CALIB</name>
              <description>If set, this will start the calibration of the RTC (32.768 kHz) clock</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>START_OSC_CALIB</name>
              <description>If set, this will start the calibration of the OSC (32 kHz) clock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IRQ_CONTROL</name>
              <description>Interrupt Control</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>IRQ when OSC calibration done</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>IRQ when RTC calibration done</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>IRQ when OSC or RTC calibration done</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>IRQ when OSC and RTC calibration done</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CALIB_OSC_COUNT_REG</name>
          <description>Calibration Count register value for the OSC clock returned after completed calibration Write any value to set bit 15 and clear bit 31 </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CAL_FRAC_COUNT</name>
              <description>This is the fractional part of the calibration counter</description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>NO_CAL_IN_PROGRESS</name>
              <description>Indicates no calibration is running (any write sets this to a 1, 0 when calibration done)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CAL_INT_COUNT</name>
              <description>This is the integer part of the calibration counter</description>
              <bitRange>[30:16]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CAL_DONE</name>
              <description>Indicates calibration is done (any write clears this to a 0)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CALIB_RTC_COUNT_REG</name>
          <description>Calibration Count register value for the RTC clock returned after completed calibration Write any value to set bit 15 and clear bit 31 </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CAL_FRAC_COUNT</name>
              <description>This is the fractional part of the calibration counter</description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>NO_CAL_IN_PROGRESS</name>
              <description>Indicates no calibration is running (any write sets this to a 1, 0 when calibration done)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CAL_INT_COUNT</name>
              <description>This is the integer part of the calibration counter</description>
              <bitRange>[30:16]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CAL_DONE</name>
              <description>Indicates calibration is done (any write clears this to a 0)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CALIB_STATUS_REG</name>
          <description>Calibration Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33</resetMask>

          <fields>
            <field>
              <name>CALIBRATION_OSC_DONE</name>
              <description>This is the done flag for calibrating the osc clock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CALIBRATION_RTC_DONE</name>
              <description>This is the done flag for calibrating the rtc clock</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>OSC_CAL_RUNNING</name>
              <description>OSC clock calibration in progress</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RTC_CAL_RUNNING</name>
              <description>RTC clock calibration in progress</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
