cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = AON_SLEEP_TIMER :: Name = AON_SLEEP_TIMER0 -->
      <name>AON_SLEEP_TIMER0</name>
      <version>1.0.0</version>
      <description>Always On Sleep Timer</description>
      <groupName>AON_SLEEP_TIMER</groupName>
      <baseAddress>0x4000d000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CONTROL</name>
          <description>Control for the Always On Sleep Timer</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0007313</resetMask>

          <fields>
            <field>
              <name>RELOAD_ENABLE</name>
              <description>Active High Reload Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SINGLE_COUNT_ENABLE</name>
              <description>Rising Edge Single Count Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IRQ_CLEAR</name>
              <description>Clears the interrupt. Auto clear. Must only be set after receiving the IRQ.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SLP_TIMER_CLK_RELOAD_DLY</name>
              <description>Current Status of slp_timer_clk_reload on the sleep clock</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SLP_TIMER_SINGLE_COUNT_ENABLE_DLY</name>
              <description>Current status of slp_timer_clk_single_count_enable on the sleep clock</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SLEEP_TIMER_ACTIVE</name>
              <description>If 1, indicates that the current sleep tiemr value is not 0</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SLEEP_TIMER_NOT_ACTIVE</name>
              <description>If 1, indicates that the current sleep timer value is 0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SINGLE_COUNT_DURATION</name>
          <description>Count for the single count AND reload</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>CURRENT_COUNT_VALUE</name>
          <description>Current count of the sleep timer</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>
      </registers>
    </peripheral>

    <peripheral> <!-- Family = AON_PWR_SEQ :: Name = AON_PWR_SEQ0 -->
      <name>AON_PWR_SEQ0</name>
      <version>1.0.0</version>
      <description>Always On Power Sequencer</description>
      <groupName>AON_PWR_SEQ</groupName>
      <baseAddress>0x4000e000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>GPIO_WAKEUP_CTRL</name>
          <description>Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup)</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x2</resetMask>

          <fields>
            <field>
              <name>BLE_ENABLE</name>
              <description>If set, this will enable GPIO_0 to wake up the BLE domain (PD4, PD5 and PD6)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_ST_WAKEUP_CTRL</name>
          <description>Controls the wakeup enable for the Always On Sleep Timer (AON_ST)</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>ARM_ENABLE</name>
              <description>If set, this will enable the AON_ST to wake up the ARM domain (PD1, PD2 and PD3)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_ENABLE</name>
              <description>If set, this will enable the AON_ST to wake up the BLE domain (PD4, PD5 and PD6)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_WAKEUP_CTRL</name>
          <description>Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU)</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x240</resetMask>

          <fields>
            <field>
              <name>BLE_ENABLE</name>
              <description>If set, this will enable the LPMCU to wake up the BLE domain (PD4, PD5 and PD6)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD7_ENABLE</name>
              <description>If set, this will enable the LPMCU to wakeup the PD7 domain (EFUSE)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BLE_ST_WAKEUP_CTRL</name>
          <description>Controls the wakeup enable for the BLE Sleep Timer (BLE_ST)</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>ARM_ENABLE</name>
              <description>If set, this will enable the BLE_ST to wake up the ARM domain</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_ENABLE</name>
              <description>If set, this will enable the BLE_ST to wake up the BLE domain</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_SLEEP_1_CTRL</name>
          <description>Controls the sleep and retention options for SLEEP request 1 from the ARM</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x670341</resetMask>

          <fields>
            <field>
              <name>ARM_SLEEP_EN</name>
              <description>Enables the SLEEP request 1 to put all ARM domains in sleep or retention (PD1, PD2A, PD2B, PD3, PD8).  PD7 has its own control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_SLEEP_EN</name>
              <description>Enables the SLEEP request 1 to put PD4 domain in sleep (BLE Core) and PD5 (BLE memories) in sleep or retention</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD6_SLEEP_EN</name>
              <description>Enables the SLEEP request 1 to put PD6 domain in sleep (BLE Sleep Timer)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD7_SLEEP_EN</name>
              <description>Enables the SLEEP request 1 to put PD7 domain in sleep (EFUSE)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2A_RETENTION_EN</name>
              <description>If 1, then PD2A will be put in retention mode when instructed to go to sleep (First ARM Memory 16K)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD2B_RETENTION_EN</name>
              <description>If 1, then PD2B will be put in retention mode when instructed to go to sleep (Second ARM Memory 16K)</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD3_RETENTION_EN</name>
              <description>If 1, then PD3 will be put in retention mode when instructed to go to sleep (Third, Fourth and Fifth ARM Memories 3x32K = 96K)</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD5_RETENTION_EN</name>
              <description>If 1, then PD5 will be put in retention mode when instructed to go to sleep (BLE Retention Memory)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD8_RETENTION_EN</name>
              <description>If 1, then PD8 will be put in retention mode when instructed to go to sleep (BLE LP Memory)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>OFF_DELAY_0_CTRL</name>
          <description>Controls the delays for turning OFF power. Default order is: Disable clock_en_early (used for dividers) Disable clock_en (main clock branch) Isolate Assert RESETN Apply BTRIM Mux Select Apply STDBY_N (active low) Cut Off Power (VDD and standard cells) Cut Off or Lower VDM Power (Array Power Supply for memories) </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4030001</resetValue>
          <resetMask>0x3f3f003f</resetMask>

          <fields>
            <field>
              <name>CLOCK_EN_EARLY</name>
              <description>Number of clock cycles before setting clock_en_early to low (clock_en is +1 of this value)</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ISOLATE</name>
              <description>Number of clock cycles before enabling the isolation cells</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RESETN</name>
              <description>Number of clock cycles before asserting RESETN</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>OFF_DELAY_1_CTRL</name>
          <description>Controls delays for turning OFF power</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8070605</resetValue>
          <resetMask>0x3f3f3f3f</resetMask>

          <fields>
            <field>
              <name>BTRIM</name>
              <description>Number of clock cycles before applying BTRIM mux select</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>STDBY_N</name>
              <description>Number of clock cycles before applying STDBY_N</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>POWER_VDD</name>
              <description>Number of clock cycles before cutting off power (VDD and standard cells)</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>POWER_VDM</name>
              <description>Number of clock cycles before cutting off or lowering power (VDM)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ON_DELAY_0_CTRL</name>
          <description>Controls the delays when turning ON power Default order is: Apply VDM Power (Memory Array) Apply VDD Power (VDD and standard cells) Remove STDBY_N Remove BTRIM Mux Select Remove Isolation De-assert RESETN Enable clock_en_early Enable clock_en </description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2727</resetValue>
          <resetMask>0x3f3f</resetMask>

          <fields>
            <field>
              <name>CLOCK_EN_EARLY_ARM</name>
              <description>Number of clock cycles before setting clock_en_early to high for ARM domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_EN_EARLY_BLE</name>
              <description>Number of clock cycles before setting clock_en_early to high for BLE domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value </description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ON_DELAY_1_CTRL</name>
          <description>Controls delays for turning ON power</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1020304</resetValue>
          <resetMask>0x3f3f3f3f</resetMask>

          <fields>
            <field>
              <name>BTRIM</name>
              <description>Number of clock cycles before removing BTRIM mux select</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>STDBY_N</name>
              <description>Number of clock cycles before de-asserting the STDBY_N</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>POWER_VDD</name>
              <description>Number of clock cycles before applying VDD power</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>POWER_VDM</name>
              <description>Number of clock cycles before applying VDM power</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>VDD_DCDC_EN_DELAY_CTRL</name>
          <description>Delay control for the vdd_dcdc_en signal (BLE domain only)</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2106</resetValue>
          <resetMask>0x3f3f</resetMask>

          <fields>
            <field>
              <name>OFF</name>
              <description>Number of clock cycles before disabling the DCDC</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ON</name>
              <description>Number of clock cycles before turning on the DCDC</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MISC_BYPASS_0_CTRL</name>
          <description>Bypass control for misc signals</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x88</resetValue>
          <resetMask>0x3dc</resetMask>

          <fields>
            <field>
              <name>PD0_LOW_VOLTAGE_EN_VAL</name>
              <description>Bypass value for pd0_low_voltage_en</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD0_LOW_VOLTAGE_EN_EN</name>
              <description>Bypass enable for pd0_low_voltage_en</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ENABLE_CLOCK_GATE</name>
              <description>If set, allows the AON PS to gate its own clock while waiting for an event to enable it again</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>VDD_DCDC_EN_VAL</name>
              <description>Bypass value for vdd_dcdc_en</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>VDD_DCDC_EN_EN</name>
              <description>Bypass enable for vdd_dcdc_en</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FORCE_ON_BLE_CORE</name>
              <description>If set, this will keep the power enabled for the BLE Core (enables the DCDC operation)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FORCE_ON_BLE_MEMORIES</name>
              <description>If set, this will keep the power enabled for the BLE memories (enables the DCDC operation)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RAW_WAKEUP_BITS</name>
          <description>Raw Wakeup Bits</description>
          <addressOffset>0x300</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>GPIO_0</name>
              <description>AO_GPIO_0 wakeup raw status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>GPIO_1</name>
              <description>AO_GPIO_1 wakeup raw status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>GPIO_2</name>
              <description>AO_GPIO_2 wakeup raw status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>AON_ST</name>
              <description>AON_ST wakeup raw status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>LPMCU</name>
              <description>LPMCU wakeup raw status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_ST</name>
              <description>BLE_ST wakeup raw status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PD_WAKEUP_BITS</name>
          <description>Individual Power Domain Wakeup Bits</description>
          <addressOffset>0x304</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x341</resetMask>

          <fields>
            <field>
              <name>ARM</name>
              <description>Indicates ARM (PD1, PD2A, PD2B, PD3, PD8) currently has a wakeup active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE</name>
              <description>Indicates BLE (PD4 and PD5) currently has a wakeup active</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD6</name>
              <description>Indicates PD6 currently has a wakeup active</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD7</name>
              <description>Indicates PD7 currently has a wakeup active</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SERVICED_REQUEST</name>
          <description>Serviced Request Status Bits</description>
          <addressOffset>0x308</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x139</resetMask>

          <fields>
            <field>
              <name>GPIO_WAKEUP</name>
              <description>Indicates GPIO wakeup has been serviced</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>AON_ST_WAKEUP</name>
              <description>Indicates AON_ST wakeup has been serviced</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>LPMCU_WAKEUP</name>
              <description>Indicates LPMCU wakeup has been serviced</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

