cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>BLE_ST_WAKEUP</name>
              <description>Indicates BLE_ST wakeup has been serviced</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SLEEP_1</name>
              <description>Indicates SLEEP 1 has been serviced</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ACTIVE_REQUEST</name>
          <description>Active Request Status Bits</description>
          <addressOffset>0x30C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x139</resetMask>

          <fields>
            <field>
              <name>GPIO_WAKEUP</name>
              <description>Indicates GPIO wakeup is the active request</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>AON_ST_WAKEUP</name>
              <description>Indicates AON_ST wakeup is the active request</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>LPMCU_WAKEUP</name>
              <description>Indicates LPMCU wakeup is the active request</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_ST_WAKEUP</name>
              <description>Indicates BLE_ST wakeup is the active request</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SLEEP_1</name>
              <description>Indicates SLEEP 1 is the active request</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LOGIC_FSM_STATES</name>
          <description>Current Logic FSM States</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33307</resetMask>

          <fields>
            <field>
              <name>MAIN_FSM_STATE</name>
              <description>Main FSM State</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RESET</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>READY</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>TRANS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>RESET_TO_READY</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>READY_TO_TRANS</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>TRANS_TO_READY</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>BLE_ON_STATE</name>
              <description>If 1, then PD4 and PD5 are ON</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_OFF_STATE</name>
              <description>If 1, then PD4 and PD5 are OFF (PD5 is in RET if set by ARM)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD6_ON_STATE</name>
              <description>If 1, then PD6 is ON</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD6_OFF_STATE</name>
              <description>If 1, then PD6 is OFF</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD7_ON_STATE</name>
              <description>If 1, then PD7 is ON</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PD7_OFF_STATE</name>
              <description>If 1, then PD7 is OFF</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral> <!-- Family = AON_GP_REGS :: Name = AON_GP_REGS0 -->
      <name>AON_GP_REGS0</name>
      <version>1.0.0</version>
      <description>Always On General Purpose Registers</description>
      <groupName>AON_GP_REGS</groupName>
      <baseAddress>0x4000f000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>AON_PINMUX_SEL</name>
          <description>Controls the pinmux selection for the AO GPIOs</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x333</resetMask>

          <fields>
            <field>
              <name>AO_GPIO_0_SEL</name>
              <description>Pinmux select for AO_GPIO_0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AO_GPIO_1_SEL</name>
              <description>Pinmux select for AO_GPIO_1</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AO_GPIO_2_SEL</name>
              <description>Pinmux select for AO_GPIO_2</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_PMU_CTRL</name>
          <description>Always On Misc Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0022</resetValue>
          <resetMask>0x1fffb3</resetMask>

          <fields>
            <field>
              <name>PMU_REGS_4TO1_SEL</name>
              <description>If 1 then uses the frequency hopping table otherwise registers in PD0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_RTC_CLK_EN</name>
              <description>Enables the PMU RTC clock</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_RETN_VAL_SEL</name>
              <description>Retention Voltage Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_LDO_EN</name>
              <description>Enables the EFUSE LDO</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_MUX_EN</name>
              <description>PMU MUX EN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_MUX_A</name>
              <description>PMU MUX A</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_MUX_SEL</name>
              <description>PMU MUX SEL</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_SENS_ADC_EN</name>
              <description>PMU Sensor ADC Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_SENS_ADC_RST</name>
              <description>PMU Sensor ADC Reset</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_BGR_EN</name>
              <description>PMU BGR EN</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_2MHZ_CLK_EN</name>
              <description>Enables the 2MHz OSC clock coming to the digital from the PMU</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PMU_26MHZ_CLK_FORCE_OFF</name>
              <description>If set, this will force off the OSC 26 MHz clock, otherwise this will follow the power for PD1</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_BLE_LP_CTRL</name>
          <description>Always On BLE LP Control</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>WAKEUP_LP_LATCH</name>
              <description>If set, this will latch the wakeup signal in the BLE LP block</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DEEP_SLEEP_STAT_SYNC_EN</name>
              <description>If set, this will use the sync flops for deep sleep stat</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_MISC_CTRL</name>
          <description>Always On Misc Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0x3fc07e</resetMask>

          <fields>
            <field>
              <name>USE_RTC_32KHZ_CLK_SLEEP_TIMER</name>
              <description>If set, this will use the RTC version of the 32khz clock for the sleep timer</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_EXT_32KHZ_CLK_SLEEP_TIMER</name>
              <description>If set, this will use an external RTC for the 32khz clock for the sleep timer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LPMCU_BOOT_RESET_MUXSEL</name>
              <description>If 1, then it uses the CPU register bit, otherwise LP_BOOT_PIN is connected</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LPMCU_USE_BOOT_REGS</name>
              <description>If 1, then the ARM will use the boot regs instead of the boot rom for the first 4 boot addresses (0x0 - 0xF)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LPMCU_CPU_RESET_OVERRIDE_EN</name>
              <description>If 1, then it will use the PD0 register value for LPMCU CPU RESET (higher priority than lpmcu_boot_reset_muxsel)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LPMCU_CPU_RESET_OVERRIDE_VAL</name>
              <description>If lpmcu_cpu_reset_override_en is set then this value will be used for the LPMCU CPU RESET</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_2M_AON_PWR_SEQ_CLK</name>
              <description>If set, this will use either the osc 2M or rtc 32kHz clock for the AON power sequencer.  The field use_rtc_aon_pwr_seq_clk determines which.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_OSC2M_AS_TB_CLK</name>
              <description>If set, this will use the osc 2M clock as the PD0 testbus clock</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AON_SLEEP_TIMER_CLK_EN</name>
              <description>If set, this will enable the 32khz clock to the AON Sleep Timer</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AON_EXT_32KHZ_OUT_EN</name>
              <description>If set, this will enable the 32khz clock to the AON pads as an output of the chip</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>USE_RTC_AON_PWR_SEQ_CLK</name>
              <description>If set, this will use the RTC clock as the AON power sequencer clock once use_2m_aon_pwr_seq_clk is also set.  This must be set first.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INVERT_WAKEUP_GPIO_0</name>
              <description>If set, this will invert the wakeup gpio_0</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FORCE_OFF_XO</name>
              <description>If set, this will force off the XO, otherwise XO is always on if BLE core is powered on.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FORCE_XO_TO_BYPASS_MODE</name>
              <description>If set, this will force the XO into bypass mode.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_GLOBAL_RESET</name>
          <description>Active Low Always On Reset Control</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1B</resetValue>
          <resetMask>0x1b</resetMask>

          <fields>
            <field>
              <name>GLOBAL_RSTN</name>
              <description>Global Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SLEEP_TIMER_RSTN</name>
              <description>Sleep Timer Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LP_RSTN</name>
              <description>BLE Low Power Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD4_RSTN</name>
              <description>Allow the SW to force PD4 into reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_PULL_ENABLE</name>
          <description>Active Low Always On Pull Enable Control</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>

          <fields>
            <field>
              <name>AO_GPIO_0</name>
              <description>Pull Enable for AO_GPIO_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AO_GPIO_1</name>
              <description>Pull Enable for AO_GPIO_1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AO_GPIO_2</name>
              <description>Pull Enable for AO_GPIO_2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_RESET_CTRL</name>
          <description>Reset Count Control for PD1, PD4, PD6 and PD7</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3A0A0</resetValue>
          <resetMask>0xff0f0</resetMask>

          <fields>
            <field>
              <name>PD1_COUNT</name>
              <description>Number of clock cycles to delay the PD1 reset. (also for PD7) Upper 4 MSBs only (bits 3:0 will be forced to 0)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD4_COUNT</name>
              <description>Number of clock cycles to delay the PD4 reset. Upper 4 MSBs only (bits 3:0 will be forced to 0)</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PD6_COUNT</name>
              <description>Number of clock cycles to delay the PD6 reset</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_BTRIM_ACTIVE</name>
          <description>BTRIM settings for active mode (i.e. not in retention)</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xf</resetMask>
        </register>

        <register>
          <name>AON_BTRIM_RETENTION</name>
          <description>BTRIM settings for retention mode</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xf</resetMask>
        </register>

        <register>
          <name>AON_LPMCU_SCRATCH_PAD</name>
          <description>Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>AON_LPMCU_COLD_BOOT</name>
          <description>To be used by ARM to determine if it is a cold boot or not</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x78</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>AON_BO_OUT_STATUS</name>
          <description>Brown Out Detected (must be cleared manually)</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>CLEAR_BROWN_OUT_REG</name>
          <description>Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition)</description>
          <addressOffset>0x84</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>RF_PMU_REGS_0</name>
          <description>RF PMU Registers</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF600409</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CLK_EDGE_SEL</name>
              <description>Select clock edge for Vreg comparator in buck converter</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparator samples on rising edge of clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparator samples on falling edge of clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

