cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>VOUT_CTRL_BUCK</name>
              <description>Select the output voltage of the buck converter</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.12V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.15V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1.17V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.20V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.22V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>1.25V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>1.27V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>1.30V</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>1.32V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>1.35V</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.37V</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.40V</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>1.42V</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>1.45V</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>1.47V</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>1.50V</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>CLK_2_4</name>
              <description>Comparator clock divider in buck converter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Divide by 2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>VREG_FILT_CTRL</name>
              <description>Not Used</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLK_DIV</name>
              <description>Programmable divider that sets the on duration of positive charging pulse</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Divide by 4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide by 6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Divide by 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Divide by 10</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Divide by 12</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Divide by 14</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Divide by 16</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RESET_FSM</name>
              <description>Force reset of FSM in buck converter</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FSM is not reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FSM is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>EN_TRISTATE</name>
              <description>Allow tristate_ctrl to control minimum time between pulses of the buck converter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Tristate logic disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Tristate logic enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TRISTATE_CTRL</name>
              <description>Controls the minimum time between pulses in the buck converter</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Divide by 4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide by 6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Divide by 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Divide by 10</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Divide by 12</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Divide by 14</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Divide by 16</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>OFFSETP_CTRL</name>
              <description>Controls a fixed comparator offset in the buck converter for positive pulses</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0.0mV offset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>0.4mV offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>0.8mV offset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.2mV offset</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.6mV offset</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>2.0mV offset</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>2.4mV offset</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>2.8mV offset</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>3.2mV offset</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>3.6mV offset</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>4.0mV offset</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>4.4mV offset</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>4.8mV offset</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>5.2mV offset</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>5.6mV offset</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>6.0mV offset</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>OFFSETN_CTRL</name>
              <description>Controls a fixed comparator offset in the buck converter for negative pulses</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0.0mV offset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>0.4mV offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>0.8mV offset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.2mV offset</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.6mV offset</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>2.0mV offset</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>2.4mV offset</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>2.8mV offset</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>3.2mV offset</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>3.6mV offset</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>4.0mV offset</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>4.4mV offset</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>4.8mV offset</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>5.2mV offset</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>5.6mV offset</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>6.0mV offset</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>P_SW_CTRL</name>
              <description>Power switch units for the buck converter</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0 power switches enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 power switch enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>2 power switches enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>3 power switches enabled</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>4 power switches enabled</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>5 power switches enabled</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>6 power switches enabled</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>CLK_SEL</name>
              <description>Source clock for the buck converter</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal 26MHz clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External 52MHz clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RF_PMU_REGS_1</name>
          <description>RF PMU Registers</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x31888C82</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>SADC_BIAS_RES_CTRL</name>
              <description>Internal reference voltage level for sensor ADC</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0.5V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>0.6V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>0.7V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>0.8V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>0.9V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>1.0V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>1.1V (only for VBATT gt 2.0V)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>1.2V (only for VBATT gt 2.0V)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>1.3V (only for VBATT gt 2.0V)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>1.4V (only for VBATT gt 2.0V)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.5V (only for VBATT gt 2.0V)</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.6V (only for VBATT gt 2.0V)</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>1.7V (only for VBATT gt 2.0V)</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>1.8V (only for VBATT gt 2.0V)</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>1.9V (only for VBATT gt 2.0V)</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>2.0V (only for VBATT gt 2.0V)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

