cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>SADC_REF_SEL</name>
              <description>Reference Voltage Source for the Sensor ADC</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Buffered reference voltage</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>IR voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>VBATT divided by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>GPIO_MS1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>GPIO_MS2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>GPIO_MS3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>GPIO_MS4</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>VBATT supply voltage</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>BOD_EN</name>
              <description>Brown Out Detector Enable Control</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LPD_CLK_INJECT_EN</name>
              <description>Low Power Domain Clock Injection Enable Control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable (Free running)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable (Lock to XO clock)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>EFUSE_LDO_BYP</name>
              <description>Bypass controlf for EFUSE LDO</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>EFUSE LDO regulates from VBATT voltage to 2.5V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description> EFUSE LDO is bypass to VBATT voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>EFUSE_LDO_VOUT_CTRL</name>
              <description>Output voltage of EFUSE LDO</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>2.3V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2.4V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2.4V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>2.5V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>2.6V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>2.7V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>2.7V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>2.8V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>EFUSE_LDO_IBIAS_CTRL</name>
              <description>Set the current bias for the EFUSE LDO</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>80uA bias current</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>100uA bias current</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>120uA bias current</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>140uA bias current</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PIERCE_RES_CTRL</name>
              <description>RTC crystal circuit feedback resistance value</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>20Mohm resistor</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>30Mohm resistor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PIERCE_GM_CTRL</name>
              <description>Transconductance of RTC oscillator</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>75nS</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>85nS</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>96nS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>106nS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>116nS</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>127nS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>137nS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>147nS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>158nS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>168nS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>178nS</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>189nS</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>199nS</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>209nS</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>220nS</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>230nS</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PIERCE_CAP_CTRL</name>
              <description>On chip single ended capacitors for RTC oscillator</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0pF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>5pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>9pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>10pF</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>11pF</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>12pF</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>13pF</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>14pF</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>15pF</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SADC_CHN_CTRL</name>
              <description>enable input channel time multiplexing to the sensor ADC</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Conversion is done on the four input channels in a time multiplexed manner</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Conversion is done for one specific input channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SADC_CHN_SEL</name>
              <description>Input channel selection for the sensor ADC</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GPIO_MS1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GPIO_MS2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>GPIO_MS3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>GPIO_MS4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>On Chip Temperature</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>VBATT divided by 4 voltage level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>LP_LDO_OUT_1P2 low power domain voltage</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Sensor ADC reference voltage level</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>CODE_IN</name>
              <description>Optional mode to improve sub-ranging technique of the sensor ADC</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>input dynamic range from 0V to VBATT voltage level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>input dynamic range from 0.08*VBATT to 0.92*VBATT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>input dynamic range from 0.17*VBATT to 0.83*VBATT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>input dynamic range from 0.25*VBATT to 0.75*VBATT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SADC_LP_CTRL</name>
              <description>Comparator biasing current for different sampling rates of the sensor ADC</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparator bias current is 4uA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparator bias current is 8uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Comparator bias current is 20uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Comparator bias current is 24uA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RF_PMU_REGS_2</name>
          <description>RF PMU Registers</description>
          <addressOffset>0x408</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>DIG_CORE_LDO_BYP</name>
              <description>Bypass mode of digital core LDO which regulates from the buck converter output to the local power domains of each digital power island</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not in bypass mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bypass mode so output will be shorted to the buck converter output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>DIG_CORE_LDO_VCTRL</name>
              <description>Voltage level of the digital core LDO when LDO is not in bypass mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0.91V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>0.96V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1.02V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.09V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>REF_HP_MODE</name>
              <description>Controls the sensor ADCs internal reference buffer output resistance</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>setting for applications that require less than 10KSPS</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>setting for throughputs between 10KSPS and 100KSPS</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>setting for 100KSPS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>setting for 325KSPS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>setting for 550KSPS</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>setting for 775KSPS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>setting for 1MSPS</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

