cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="GPIO0"> <!-- Family =  GPIO :: Name = GPIO1 -->
      <name>GPIO1</name>
      <baseAddress>0x40011000</baseAddress>
    </peripheral>

    <peripheral> <!-- Family = SPI_FLASH :: Name = SPI_FLASH0 -->
      <name>SPI_FLASH0</name>
      <version>1.0.0</version>
      <description>SPI Flash Controller</description>
      <groupName>SPI_FLASH</groupName>
      <baseAddress>0x40012000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>MODE_CTRL</name>
          <description>SPI Flash Mode Control</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8f</resetMask>

          <fields>
            <field>
              <name>MODE</name>
              <description>SPI Modes</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Mode 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Mode 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Mode 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Mode 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>BYPASS_CS_PRE</name>
              <description>Bypass CS PRE state</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BYPASS_CS_POST</name>
              <description>Bypass CS POST state</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>MODE_SELECT</name>
              <description>Set to 1 to use external bits for mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TRANSACTION_CTRL</name>
          <description>Transaction Control (Cleared after each transaction completes)</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xffffff87</resetMask>

          <fields>
            <field>
              <name>CMD_COUNT</name>
              <description>Number of bytes to be transferred or received</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FLASH_TRANS_START</name>
              <description>Rising Edge Flast Transaction Start</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDATA_COUNT</name>
              <description>Number of bytes to be programmed to flash</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>READ_CTRL</name>
          <description>Read Control (Cleared after each transaction completes)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffff</resetMask>

          <fields>
            <field>
              <name>RDATA_COUNT</name>
              <description>Number of data bytes to be read from flash</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CMD_BUFFER0</name>
          <description>Command Buffer 0 (Bytes 3 - 0)</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>CMD_BUFFER1</name>
          <description>Command Buffer 1 (Bytes 7 - 4)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>DIRECTION</name>
          <description>Read/Write bit for Bytes 7 - 0</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>IRQ_STATUS</name>
          <description>IRQ Status (Write 0 to bit to clear, Read clears interupts)</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>FLASH_TRANS_DONE</name>
              <description>Current Flash Transaction Done</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>AHB_ERROR_RESPONSE</name>
              <description>AHB Error Response</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DMA_START_ADDRESS</name>
          <description>DMA Starting Address</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>CONFIG</name>
          <description>SPI Flash Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x103</resetValue>
          <resetMask>0x1ff</resetMask>

          <fields>
            <field>
              <name>ENDIANNESS</name>
              <description>1 for Little Endian</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>REVERSE_CMD_BUFFER</name>
              <description>Reverse bits of every byte in cmd_buffer</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RDATA_REVERSE</name>
              <description>Reverse bits of every data byte read from flash</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>REVERSE_INCOMIND_DATA</name>
              <description>Reverse bits of status registers read from flash</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPI_INTERFACE_CONFIG_DEBUG</name>
              <description>Debug only</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WDATA_REVERSE</name>
              <description>Reverse bits of every data byte written to flash</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TX_CONTROL</name>
          <description>TX Control</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff0f</resetMask>

          <fields>
            <field>
              <name>DRIVE_0_ON_TX</name>
              <description>Drive 0 on TX while reading</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DRIVE_1_ON_TX</name>
              <description>Drive 1 on TX while reading</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TOGGLE_ON_TX</name>
              <description>Toggle TX while reading</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DUMMY_ON_TX</name>
              <description>Send dummy_byte while reading</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DUMMY_BYTE</name>
              <description>Byte to be sent for dummy_on_tx option</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>STATUS</name>
          <description>Misc Status</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1773</resetMask>

          <fields>
            <field>
              <name>AHB_MASTER_STATE</name>
              <description>AHB Master State</description>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>IDLE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>WAIT_GRANT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ADDR_PHASE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>DATA_PHASE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>FIFO_CTRL_STATE</name>
              <description>FIFO Control State</description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FLASH_IDLE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GET_DATA_FROM_FLASH</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>WRITE_DATA_TO_AHB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>GET_DATA_FROM_AHB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>WRITE_DATA_TO_FLASH</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SPI_MASTER_STATE</name>
              <description>SPI Master State</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>IDLE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>READ</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>WRITE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>READ_FLASH</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>WRITE_FLASH</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>PRE_ACTION</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>POST_ACTION</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>WAIT_AHB</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>SPI_MASTER_CSN</name>
              <description>Inverted version of the SPI Master Chip Select</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
