cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="GPIO0"> <!-- Family =  GPIO :: Name = GPIO2 -->
      <name>GPIO2</name>
      <baseAddress>0x40013000</baseAddress>
    </peripheral>

    <peripheral> <!-- Family = ARM_SYSCTRL :: Name = ARM_SYSCTRL0 -->
      <name>ARM_SYSCTRL0</name>
      <version>1.0.0</version>
      <description>ARM System Control</description>
      <groupName>ARM_SYSCTRL</groupName>
      <baseAddress>0xe000e000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>ACTLR</name>
          <description>Auxiliary Control Register (not implemented)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>SYST_CSR</name>
          <description>SysTick Control and Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x10007</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Indicates the enabled status of the SysTick counter</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter Operating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TICKINT</name>
              <description>Indicates whether counting to 0 causes the status of the SysTick exception to change to pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Count to 0 does not affect the SysTick exception status</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Count to 0 changes the SysTick excpetion status to pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>CLKSOURCE</name>
              <description>SysTick uses the processor clock (writes are ignored)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>COUNTFLAG</name>
              <description>If 1 then the timer has counted to 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SYST_RVR</name>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffff</resetMask>
        </register>

        <register>
          <name>SYST_CVR</name>
          <description>SysTick Current Value Register (Any Write Clears to 0)</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffff</resetMask>
        </register>

        <register>
          <name>SYST_CALIB</name>
          <description>SysTick Calibration Value Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0ffffff</resetMask>

          <fields>
            <field>
              <name>TENMS</name>
              <description>Holds a reload value to be used for 10ms timing. If 0 then calibration value is not known.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>SKEW</name>
              <description>If 1 then 10ms calibration value is inexact</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>NOREF</name>
              <description>If 1 then reference clock is not implemented</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_ISER</name>
          <description>Interrupt Set-Enable Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>SETENA</name>
              <description>Write 1 to enable the associated interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_ICER</name>
          <description>Interrupt Clear Enable Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CLRENA</name>
              <description>Write 1 to disable the associated interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_ISPR</name>
          <description>Interrupt Set-Pending Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>SETPEND</name>
              <description>Change the state of the associated interrupt to pending</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_ICPR</name>
          <description>Interrupt Clear-Pending Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Change the state of the associated interrupt to not pending</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR0</name>
          <description>Interrupt Priority Register 0</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0c0</resetMask>

          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of Interrupt 0</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N1</name>
              <description>Priority of Interrupt 1</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N2</name>
              <description>Priority of Interrupt 2</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N3</name>
              <description>Priority of Interrupt 3</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR1</name>
          <description>Interrupt Priority Register 1</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0c0</resetMask>

          <fields>
            <field>
              <name>PRI_N4</name>
              <description>Priority of Interrupt 4</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N5</name>
              <description>Priority of Interrupt 5</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N6</name>
              <description>Priority of Interrupt 6</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N7</name>
              <description>Priority of Interrupt 7</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR2</name>
          <description>Interrupt Priority Register 2</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0c0</resetMask>

          <fields>
            <field>
              <name>PRI_N8</name>
              <description>Priority of Interrupt 8</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N9</name>
              <description>Priority of Interrupt 9</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N10</name>
              <description>Priority of Interrupt 10</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N11</name>
              <description>Priority of Interrupt 11</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR3</name>
          <description>Interrupt Priority Register 3</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0c0</resetMask>

          <fields>
            <field>
              <name>PRI_N12</name>
              <description>Priority of Interrupt 12</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N13</name>
              <description>Priority of Interrupt 13</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N14</name>
              <description>Priority of Interrupt 14</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N15</name>
              <description>Priority of Interrupt 15</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR4</name>
          <description>Interrupt Priority Register 4</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0e0</resetMask>

          <fields>
            <field>
              <name>PRI_N16</name>
              <description>Priority of Interrupt 16</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N17</name>
              <description>Priority of Interrupt 17</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N18</name>
              <description>Priority of Interrupt 18</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N19</name>
              <description>Priority of Interrupt 19</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR5</name>
          <description>Interrupt Priority Register 5</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0e0</resetMask>

          <fields>
            <field>
              <name>PRI_N20</name>
              <description>Priority of Interrupt 20</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N21</name>
              <description>Priority of Interrupt 21</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N22</name>
              <description>Priority of Interrupt 22</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N23</name>
              <description>Priority of Interrupt 23</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR6</name>
          <description>Interrupt Priority Register 6</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0e0</resetMask>

          <fields>
            <field>
              <name>PRI_N24</name>
              <description>Priority of Interrupt 24</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N25</name>
              <description>Priority of Interrupt 25</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N26</name>
              <description>Priority of Interrupt 26</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N27</name>
              <description>Priority of Interrupt 27</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>NVIC_IPR7</name>
          <description>Interrupt Priority Register 7</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c0c0e0</resetMask>

          <fields>
            <field>
              <name>PRI_N28</name>
              <description>Priority of Interrupt 28</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N29</name>
              <description>Priority of Interrupt 29</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N30</name>
              <description>Priority of Interrupt 30</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_N31</name>
              <description>Priority of Interrupt 31</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CPUID</name>
          <description>CPU Identification Register</description>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x410CC200</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ICSR</name>
          <description>Interrupt Control State Register</description>
          <addressOffset>0xD04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9edff1ff</resetMask>

          <fields>
            <field>
              <name>VECTACTIVE</name>
              <description>Exception number for the current executing exception</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>VECTPENDING</name>
              <description>Exception number for highest priority pending exception</description>
              <bitRange>[20:12]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ISRPENDING</name>
              <description>If 1, Interrupt is pending</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ISRPREEMPT</name>
              <description>If 1, will service a pending exception</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PENDSTCLR</name>
              <description>Clear Pending SysTick</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>PENDSTSET</name>
              <description>Set pending SysTick</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PENDSVCLR</name>
              <description>Clearing pending PendSV</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>PENDSVSET</name>
              <description>Set pending PendSV interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>NMIPENDSET</name>
              <description>Activate NMI Exception</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AIRCR</name>
          <description>Application Interrupt and Reset Control Register</description>
          <addressOffset>0xD0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff8006</resetMask>

          <fields>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>Clears all active state information for fixed and configurable exceptions</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>SYSRESETREQ</name>
              <description>Active High System Reset Request</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>ENDIANNESS</name>
              <description>If 1 then big endian</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>VECTKEY</name>
              <description>Vector Key, must write 0x05FA to this otherwise the write is UNPREDICTABLE</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCR</name>
          <description>System Control Register</description>
          <addressOffset>0xD10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x16</resetMask>

          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>Enter sleep state on exit from an ISR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SLEEPDEEP</name>
              <description>Selected sleep state is deep sleep</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SEVONPEND</name>
              <description>Transitions from inactive to pending are wakeup events</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CCR</name>
          <description>Configuration and Control Register</description>
          <addressOffset>0xD14</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x208</resetMask>

          <fields>
            <field>
              <name>UNALIGN_TRP</name>
              <description>Unaligned work and halfword accesses generate a HardFault exception</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

