cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
            <field>
              <name>STKALIGN</name>
              <description>On exception entry, SP used prior to exception is adjusted to be 8-byte aligned and context to restore it is saved</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SHPR2</name>
          <description>System Handler Priority Register 2</description>
          <addressOffset>0xD1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0000000</resetMask>

          <fields>
            <field>
              <name>PRI_11</name>
              <description>Priority of system handler 11, SVCall</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SHPR3</name>
          <description>System Handler Priority Register 3</description>
          <addressOffset>0xD20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc0c00000</resetMask>

          <fields>
            <field>
              <name>PRI_14</name>
              <description>Priority of system handler 14, PendSV</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PRI_15</name>
              <description>Priority of system handler 15, SysTick</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SHCSR</name>
          <description>System Handler Control and State Register</description>
          <addressOffset>0xD24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000</resetMask>

          <fields>
            <field>
              <name>SVCALLPENDED</name>
              <description>SVCall is pending</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DFSR</name>
          <description>Debug Fault Status Register</description>
          <addressOffset>0xD30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>HALTED</name>
              <description>Halt Request Debug Event Active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BKPT</name>
              <description>At least one breakpoint debug event</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DWTTRAP</name>
              <description>At least one debug event generated by DWT</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>VCATCH</name>
              <description>Vector catch debug event generated</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EXTERNAL</name>
              <description>EDBGRQ debug event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DHCSR</name>
          <description>Debug Halting Control and Status Register</description>
          <addressOffset>0xDF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30f000f</resetMask>

          <fields>
            <field>
              <name>C_DEBUGEN</name>
              <description>Halting Debug Enabled (Must write 0xA05F to bits 31:16 to access)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>C_HALT</name>
              <description>Request a running processor to halt (Must write 0xA05F to bits 31:16 to access)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>C_STEP</name>
              <description>Single-Stepping Enabled (Must write 0xA05F to bits 31:16 to access)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>C_MASKINTS</name>
              <description>Mask PendSV, SysTick and external configurable interrupts (Must write 0xA05F to bits 31:16 to access)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>S_REGRDY</name>
              <description>Transfer to or from the DCRDR is complete</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>S_HALT</name>
              <description>In Debug State</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>S_SLEEP</name>
              <description>Sleeping</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>S_LOCKUP</name>
              <description>Locked Up</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>S_RETIRE_ST</name>
              <description>At least one instruction has completed since last DHCSR read</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>S_RESET_ST</name>
              <description>At least one reset since last DHCSR read</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DCRSR</name>
          <description>Debug Core Register Selector Register</description>
          <addressOffset>0xDF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1001f</resetMask>

          <fields>
            <field>
              <name>REGSEL</name>
              <description>Specifies the ARM core register or special purpose register to transfer</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ARM Core Register R0</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ARM Core Register R1</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ARM Core Register R2</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>ARM Core Register R3</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>ARM Core Register R4</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>ARM Core Register R5</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>ARM Core Register R6</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>ARM Core Register R7</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>ARM Core Register R8</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>ARM Core Register R9</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>ARM Core Register R10</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>ARM Core Register R11</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>ARM Core Register R12</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>Current SP</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>LR</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DebugReturnAddress</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>xPSR</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>MSP</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>PSP</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>CONTROL and PRIMASK</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>REGWNR</name>
              <description>If 1 then transfer is a write</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DCRDR</name>
          <description>Debug Core Register Data Register</description>
          <addressOffset>0xDF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>DBGTMP</name>
              <description>Data Temporary Cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DEMCR</name>
          <description>Debug Exception and Monitor Control Register</description>
          <addressOffset>0xDFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1000401</resetMask>

          <fields>
            <field>
              <name>VC_CORERESET</name>
              <description>Reset Vector Catch Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>VC_HARDERR</name>
              <description>Halting Debug Trap Enabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DWTENA</name>
              <description>DWT Enabled</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_PID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_C_CODE</name>
              <description>JEP106 C Code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK_COUNT</name>
              <description>Block Count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_PID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0xFE0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 7:0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_PID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0xFE4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 11:8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEP106_ID_3_0</name>
              <description>JEP106 ID Code Bits 3:0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_PID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0xFE8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_ID_6_4</name>
              <description>JEP106 ID Code Bits 6:4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEDEC_USED</name>
              <description>JEDEC Used</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>REVISION</name>
              <description>Revision</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_PID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0xFEC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CUSTOMER_MOD_NUMBER</name>
              <description>Customer Modification Number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ECO_REV_NUMBER</name>
              <description>ECO Revision Number</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS_CID0</name>
          <description>Component ID Register 0</description>
          <addressOffset>0xFF0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>SCS_CID1</name>
          <description>Component ID Register 1</description>
          <addressOffset>0xFF4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xE0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>SCS_CID2</name>
          <description>Component ID Register 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>SCS_CID3</name>
          <description>Component ID Register 3</description>
          <addressOffset>0xFFC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xff</resetMask>
        </register>
