cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = ARM_BPU :: Name = ARM_BPU0 -->
      <name>ARM_BPU0</name>
      <version>1.0.0</version>
      <description>ARM Breakpoint Control</description>
      <groupName>ARM_BPU</groupName>
      <baseAddress>0xe0002000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>BP_CTRL</name>
          <description>Break Point Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>BPU is Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>KEY</name>
              <description>Must Write this bit to a 1 for register write to be accepted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>NUM_CODE</name>
              <description>Number of breakpoint comparators</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_COMP0</name>
          <description>Break Point Compare Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0xdffffffd</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Comparator is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COMP</name>
              <description>Bits 28:2 of the comparison address</description>
              <bitRange>[28:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BP_MATCH</name>
              <description>Behavior when the COMP address is matched</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Breakpoint Matching</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Breakpoint on lower halfword</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Breakpoint on upper halfword</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Breakpoint on both halfwords</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_COMP1</name>
          <description>Break Point Compare Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0xdffffffd</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Comparator is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COMP</name>
              <description>Bits 28:2 of the comparison address</description>
              <bitRange>[28:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BP_MATCH</name>
              <description>Behavior when the COMP address is matched</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Breakpoint Matching</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Breakpoint on lower halfword</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Breakpoint on upper halfword</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Breakpoint on both halfwords</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_COMP2</name>
          <description>Break Point Compare Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0xdffffffd</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Comparator is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COMP</name>
              <description>Bits 28:2 of the comparison address</description>
              <bitRange>[28:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BP_MATCH</name>
              <description>Behavior when the COMP address is matched</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Breakpoint Matching</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Breakpoint on lower halfword</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Breakpoint on upper halfword</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Breakpoint on both halfwords</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_COMP3</name>
          <description>Break Point Compare Register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0xdffffffd</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Comparator is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COMP</name>
              <description>Bits 28:2 of the comparison address</description>
              <bitRange>[28:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BP_MATCH</name>
              <description>Behavior when the COMP address is matched</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Breakpoint Matching</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Breakpoint on lower halfword</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Breakpoint on upper halfword</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Breakpoint on both halfwords</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_PID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_C_CODE</name>
              <description>JEP106 C Code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK_COUNT</name>
              <description>Block Count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_PID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0xFE0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 7:0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_PID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0xFE4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 11:8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEP106_ID_3_0</name>
              <description>JEP106 ID Code Bits 3:0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_PID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0xFE8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_ID_6_4</name>
              <description>JEP106 ID Code Bits 6:4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEDEC_USED</name>
              <description>JEDEC Used</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>REVISION</name>
              <description>Revision</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_PID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0xFEC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CUSTOMER_MOD_NUMBER</name>
              <description>Customer Modification Number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ECO_REV_NUMBER</name>
              <description>ECO Revision Number</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>BP_CID0</name>
          <description>Component ID Register 0</description>
          <addressOffset>0xFF0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>BP_CID1</name>
          <description>Component ID Register 1</description>
          <addressOffset>0xFF4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xE0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>BP_CID2</name>
          <description>Component ID Register 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>BP_CID3</name>
          <description>Component ID Register 3</description>
          <addressOffset>0xFFC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xff</resetMask>
        </register>
