cmsis-svd/cmsis-svd/data/Microchip/ATSAMB11G18A.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = ARM_ROM :: Name = ARM_ROM0 -->
      <name>ARM_ROM0</name>
      <version>1.0.0</version>
      <description>ARM ROM</description>
      <groupName>ARM_ROM</groupName>
      <baseAddress>0xe00ff000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>ROM_SCS</name>
          <description>Points to the SCS at 0xE000E000</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFF0F003</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ROM_DWT</name>
          <description>Points to the DWT at 0xE0001000</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFF02003</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ROM_BPU</name>
          <description>Points to the BPU at 0xE0002000</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFF03003</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ROM_EOT</name>
          <description>End of Table Marker</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>ROM_CSMT</name>
          <description>System Memory accessible through DAP</description>
          <addressOffset>0xFCC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>ROM_PID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_C_CODE</name>
              <description>JEP106 C Code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK_COUNT</name>
              <description>Block Count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ROM_PID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0xFE0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x71</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 7:0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ROM_PID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0xFE4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 11:8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEP106_ID_3_0</name>
              <description>JEP106 ID Code Bits 6:4</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ROM_PID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0xFE8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_ID_6_4</name>
              <description>JEP106 ID Code Bits 6:4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEDEC_USED</name>
              <description>JEDEC Used</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>REVISION</name>
              <description>Revision</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ROM_PID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0xFEC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CUSTOMER_MOD_NUMBER</name>
              <description>Customer Modification Number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ECO_REV_NUMBER</name>
              <description>ECO Revision Number</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ROM_CID0</name>
          <description>Component ID Register 0</description>
          <addressOffset>0xFF0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>ROM_CID1</name>
          <description>Component ID Register 1</description>
          <addressOffset>0xFF4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>ROM_CID2</name>
          <description>Component ID Register 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>ROM_CID3</name>
          <description>Component ID Register 3</description>
          <addressOffset>0xFFC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xff</resetMask>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
